const text = {
  2: {
    head: "翻转变换",
  },
  3: {
    head: "对数变换",
    tips: "请输入参数c值",
  },
  4: {
    head: "幂次变换",
    tip1: "请输入c值",
    tip2: "请输入gamma值",
  },
  5: {
    head: "对比度拉伸",
    tip1: "请输入拉伸的最小像素(整数)",
    tip2: "请输入拉伸的最大像素(整数)",
  },
  6: {
    head: "灰度级切片",
    tip1: "请输入切片的最小像素(整数)",
    tip2: "请输入切片的最大像素(整数)",
  },
  7: {
    head: "位平面切片",
    tips: "请输入切片位值(0-7)",
  },
  8: {
    head: "加减乘除",
    tips: "请输入操作符(仅支持 'add', 'subtract', 'multiply' and 'divide')",
  },
  9: {
    head: "非运算",
  },
  10: {
    head: "与、或、异或运算",
    tips: "请输入操作符(仅支持 '&', '|', and '^')",
  },
  11: {
    head: "直方图均衡化",
  },
  12: {
    head: "线性平滑滤波器",
    tips: "请输入滤波器大小(太大会很慢很慢，推荐3-5)",
  },
  13: {
    head: "中值滤波器",
    tips: "请输入滤波器大小",
  },
  14: {
    head: "锐化滤波器",
    tips: "请输入微分阶数(仅支持一/二阶)",
  },
  15: {
    head: "RGB转CMY",
  },
  16: {
    head: "RGB转HSI",
  },
  17: {
    head: "RGB转YUV",
  },
  18: {
    head: "RGB转YCbCr",
  },
  19: {
    head: "RGB补色",
  },
  20: {
    head: "线性灰度变换",
    tip1: "请输入缩放因子α",
    tip2: "请输入平移因子β",
  },
  21: {
    head: "傅里叶变换(巨tm慢，慎用)",
  },
  22: {
    head: "快速傅里叶变换",
  },
  23: {
    head: "理想低通滤波器",
    tips: "请输入截止频率(正整数)",
  },
  24: {
    head: "巴特沃斯低通滤波器",
    tip1: "请输入截止频率(正整数)",
    tip2: "请输入阶数(正整数)",
  },
  25: {
    head: "理想高通滤波器",
    tips: "请输入截止频率(正整数)",
  },
  26: {
    head: "巴特沃斯高通滤波器",
    tip1: "请输入截止频率(正整数)",
    tip2: "请输入阶数(正整数)",
  },
};

export default text;
